Autodesk.Navisworks.Api.View.GenerateThumbnail(System.Int32,System.Int32,System.Double)
Generates a Thumbnail Image for this View.

Autodesk.Navisworks.Api.View.GenerateThumbnailByRayTrace(System.Int32,System.Int32)
Generates a Thumbnail Image for this View.